Revit 2024 API
DimensionSegmentArray Constructor
Initializes a new instance of the DimensionSegmentArray class
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DimensionSegmentArray()
Visual Basic
Public Sub New
Visual C++
public:
DimensionSegmentArray()
See Also
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace